import math
from math import sqrt

print("Кобяк Андрей Вячеславович \nИУ5-52Б \nРешаем биквадратное уравнение(ax^4+bx^2+c=0)\nВведите, пожалуйста, коэффициенты(A, B, C)")
# -----------------Ввод-------------------------------------
i = 0
while i < 3:
    try:
        a = float(input("a = "))
        i = i + 1
    except ValueError:
        print("Некорректный ввод")
    try:
        b = float(input("b = "))
        i = i + 1
    except ValueError:
        print("Некорректный ввод")
    try:
        c = float(input("c = "))
        i = i + 1
    except ValueError:
        print("Некорректный ввод")
# -----------------1шаг-------------------------------------
D = b ** 2 - 4 * a * c
print("-----------------------\nДискриминант D = %.1f" % D, "\n-----------------------")

if D < 0:
    print("Действительных корней нет")
else:
    t1 = (-b+sqrt(D))/(2*a)
    t2 = (-b-sqrt(D))/(2*a)
# ----------------2шаг для 1/2-------------------------------
if t1 < 0:
    print("1 корень и 2 корень - не действительные")
else:
    if t1 > 0:
        x1 = sqrt(t1)
    x2 = -x1
    print("1 корень = %.2f" % x1, "| 2 корень = %.2f" % x2)
# -----------------2шаг для 3/4-------------------------------
if t2 < 0:
    print("3 корень и 4 корень - не действительные")
else:
    if t2 > 0:
        x3 = sqrt(t2)
    x4 = -x3
    print("3 корень = %.2f" % x3, "| 4 корень = %.2f" % x4)
